{
  "title": "「負荷」について",
  "slug": "antilag",
  "description": "Q?　重い、負荷かかってる…って何？いったいどういうことだ？の疑問に（多分）わかりやすくお答えします！そして、ラグを発生させないための、負荷軽減案内です。あなた一つの行動で、サーバーがもっと安定化し、住人みんなが楽しく住めるようになったら良いと思いませんか？",
  "date": "2019-11-05T11:29:16.331Z",
  "category": "アーカイブ",
  "body": "１人のプレイヤーがサーバーに大きな負荷を掛けて重くすれば全てのプレイヤーに影響が及びます。\n\nもりのパーティ！のサーバーは企業ではなく個人が立てている程度のスペックであり、有志の寄付により運営されているサーバーだという事をよく考えましょう。\n\n[[toc]]\n\n※負荷（軽量化）に関して、Minecraft Japan Wikiにも記載があります。調べて見てね。\n\n# はてな？ふむ！辞典の続き\n\nQ?　もっと詳しく！！制限されてるアイテムを置くとなんで負荷って言われているの？その他の負荷原因はなにかある？\n\n## A!!１　★エンティティの密集\n\nエンティティ【ＭＯＢ，落ちてるアイテム,浮いてるアイテム,ブロックエンティティ等】は数が多くなりすぎると、PCリソースを圧迫して動作を不安定にする原因となる。\n\n以下のような行動はPCに負荷を掛けます（マルチだと自分の行動が読み込まれ、もちろん他人にも影響する）。\n・負荷が発生しやすい状態【⇒例えばこうしよう の案】\n\n<div style=\"background:#fffacd;padding:10px;border:3px dotted #66cdaa;\">\n\n・動物を大量に繁殖させて密集させ、押し合っている状態にする。\n【⇒重なってちらつくようなすし詰めにしない！広いスペースで飼う！余裕を持たせる！なんなら動物を一頭ずつ分けて飼うと低負荷。】\n\n・村人を大量に増やす（村人のＡＩにより動物よりも重くなりやすい）\n【⇒「交易も醍醐味でしょ」とやたらと増やさないこと！特に生活サーバー内。村人使うなら厳選して【少数精鋭】で頼むよ！多すぎる場所を発見したら強制まびきがあり得ます】\n\n・トラップタワーで大量の敵MOBを出現させる。MOBを一度に大量に倒し、アイテムや経験値オーブを溢れさせる。\n・アイテムを大量に捨てる / 大量のアイテムの入ったチェストを破壊する。\n【⇒エンティティ密集が読み込まれ過度の処理速度低下につながる…自分ひとりのサーバーではありません。湧き層、処理層を調整してください】\n\n・アーマースタンド、ボート、トロッコなどのMOBタイプの設置物。\n【⇒一昔前にあったボート大量重ねおよび射出装置は害悪の極み。最近ないと思いますが、間違ってもやらないように】\n\n・額縁や看板などのデータ量の多い設置物。\n・旗や焚き火などのアニメーションの多いブロックの過剰設置\n・装置に必要な回路系ブロックを置きまくる\n【⇒本当にその数が必要かどうか…？減らす方法はないだろうか。どうやっても大量に設置が必要な装置等は、もりパでは作らないに限る】</div>\n\n## A!!２ ★ブロックエンティティの中でも使われやすい「チェスト」は…負荷が大きい！\n\n◎樽の方が軽いっていうのはなんで？\n⇒チェストは、置いたときに隙間があります（マイクラで宝探しMAP等をやったことがある人は経験があるでしょう。隙間から奥のブロックがクリックできる）。\n開閉時のアニメーションが必要だからでもあるでしょう。開閉時アニメーションに起因する描画負荷が大きい（シングルよりマルチプレイが顕著）。\nそして、この隙間にみえるアイテム・ブロック等の描写も必要になる為、完全な１マスブロック（フルブロック）である樽より描写負荷が高いのです。\n例えば…\nある人の検証によると\n【60fps】ある環境で、同じ数のチェストと樽を別のところにおいて、\n・チェストの方を向くと【30fps】まで処理能力が落ちるが、\n・樽の方を向いても【59fps】でほぼフレームレートが落ちなかった。\nという結果もあります。\n\n## A!!３　他に、これはどうして？と思われやすい物2選\n\n★看板\n⇒看板に関しては、設置による装飾ではなく、書かれている文字の多さが高負荷に繋がる為制限に入れています。\n文字に光るイカ墨を使いまくるとさらに負荷が増えます。使いどころが大事。\n\n★ホッパー\nホッパーは、上にアイテムがないか確認する処理を常に続けているため、そのままにしておくと処理に負荷を与えます。\nまた、内部にアイテムが入っている際は、アイテムを送ろうとする処理もあります。\n※v1.21から、フルブロック(泥などのフルブロック未満は含まない)を上に置くとエンティティ―サーチしなくなりました。\nよってつなげるパイプ役だけの部分のホッパー上部には、このバージョンからは、コンポスターのような機能があるブロックより、石や土などの特殊な機能が無いフルブロックが最適らしい。\n\n## A!!４　装置\n\n・レッドストーン回路の種類等の情報は[こちら](https://minecraft-ja.gamepedia.com/%E3%83%AC%E3%83%83%E3%83%89%E3%82%B9%E3%83%88%E3%83%BC%E3%83%B3%E5%9B%9E%E8%B7%AF)を参照して下さい。\n・大規模な装置になると稼働中は大きな負荷が掛かります。\n**かっこいいから、とか、効率と量を求めてむやみに湧き層や処理層を増やさないで下さい。\nここは装置に特化したサーバーではないです。**\n装置は必ず オン/オフ のスイッチを設け、使わないときはスイッチをオフにするよう気をつけましょう。\n装置、トラップタワーについてはこちらのもりパwiki（辞典内）参照のこと\n・[装置](https://wiki.morino.party/faq2/#%E8%A3%85%E7%BD%AE%E5%9B%9E%E8%B7%AF%E9%96%A2%E9%80%A3%E3%81%AE%E3%81%9D%E3%81%AE%E4%BB%96)\n・[トラップタワー](https://wiki.morino.party/faq2/#%E3%83%88%E3%83%A9%E3%83%83%E3%83%97%E3%82%BF%E3%83%AF%E3%83%BCmobfarm)\n\n・レッドストーンランプをクロック回路で点滅させる、暗い部屋のでレッドストーン回路の動作など、明るさレベルの計算によって、負荷が発生することがある。\n回路のある空間はレベル15まで明るくしておき明るさ変化をなくすと良いらしい。\n\n## 負荷軽減を自分なりに工夫してみよう\n\n現もりパサーバー環境において、重いと思ったら、大体はサーバーのせいではない…です。\n「負荷」についての辞典A!!部分や、このページを参考にしながら、まずは自分の行動、身の回りを確認しましょう。\n\n**自分のPC、ゲーム設定による負荷軽減**\n◆Minecraft（バニラ）でできる軽量化\n・マイクラランチャーの起動構成での設定（PC環境によって異なる為おススメがあるわけではありません。調べてみましょう。わからなければ触らないこと。）\n・マイクラメニュー「ビデオ設定」で描画方法の見直し（検索して調べてみましょう！）\n◆軽量化MOD\nもりパwiki内リンク⇒[オススメMOD](https://wiki.morino.party/recommendedmods)：最終更新23/11/27\nリンクその２⇒[軽量化のスゝメ](https://wiki.morino.party/performanceup)：最終更新20/6/11…更新日が古いです。同じMODを利用しており、変更があったり最新情報を編集できるかたはお願いします。\n\n# 画像付きご案内\n\n## エンティティ\n\nエンティティの種類は[こちら](https://minecraft-ja.gamepedia.com/%E3%82%A8%E3%83%B3%E3%83%86%E3%82%A3%E3%83%86%E3%82%A3)を参照して下さい。\n\nエンティティはサーバーが重くなる大きな原因の１つです。 扱う際は必要最小限に留めましょう。\n\n## エンティティ数の見方\n\n読み込まれているエンティティの数は、F3デバッグモードで表示することが出来る。\nF3を押した時に出るE:の値は、あなたの周辺に存在するエンティティの数になっています。\nそしてこの周辺のエンティティ処理は、あなたが思っている以上にサーバーへ大きな負荷を掛けます。必要以上にエンティティを増やさないように気を付けましょう。\n\n例えばE:値を150以下に抑えるにはどうするのか。\nE:の値は『視野内に入ってる数/描画距離範囲内（チャンク）の数』が表示される。\n（例）「E:43/50」→近くに５０このエンティティ（ＭＯＢ含む）があり４３個は視野内にある。\n\n![F3デバッグモード画面一部](/img/entity.jpg \"F3デバッグモード画面一部\")\n\nこの場合、周辺のエンティティ数は172なので目標値より過剰です。\n方法としては、地道の一言・・・Ｅ値に影響するものを減らしてまたＦ３画面でＥ値を確認…という作業。\n描画範囲内の数なので少し移動すると数が１０くらい変動しますがそこは大体で…。\nある一か所をみて急に重くなる時は視界内にある数（Ｅ値の分子のほう）が大きくなってると思います。エンティティの密度が高いってことだね！分子が減るようにしてみましょう。\n≪参考≫Ｅ値の下行にある「Ｔ」値：読み込まれているチャンク内のエンティティ(Mobやドロップアイテムを含む)の総数を表示する。E値の分母と同じってことね～。\nＥ値の上の「Ｃ」値：読み込まれた領域のチャンクセクションの総数のうち、描画されたチャンクセクションの数。なんのこっちゃ(・ω・)気にしなくていいでしょう。\n\n≪知ってる人は知ってる豆知識≫\n地面や向こうに何もないはずの壁を見てＥの分子に数字が出ている時は、地下（や洞窟壁等の向こう）に空洞があってＭＯＢが湧いている確率が高い…。\n\n## MOBを密集させない\n\n![](/img/2020-09-02_00.04.08.png)\n\n狭い範囲にMOBを押し込むと負荷が大きいです。\n\nこちらは飼育範囲に対して、見るからにあふれ出そう（一部あふれてる…）なぎゅーぎゅーパンダさん達。\n\n![ぎゅーぎゅーパンダ](/img/pandaisugi.png \"ぎゅーぎゅーパンダ\")\n\nこの、ぎゅーぎゅーパンダさんを見た状態でF3を開くとこのような状態です。\n\n![ぎゅーぱんＥ](/img/pandaisugi-e.jpg \"ぎゅーぱんＥ\")\n\n\nエンティティの数がやヴぁいですね…（(;^ω^)\\\n視界内がほぼパンダなので、パンダだけで２００匹近くいることに…どうしてこんなことに…🐼\nfpsが大幅に下がらなくとも、こういう場所に近づくとPCファンがめっちゃうるさくなったり熱くなります。\nこのパンダさんの場所に関わらず、心当たりのある飼い方をしているプレイヤーは、増やしすぎないように管理してくださいね。\n\nまた、読み込み描写に加えてMOB同士で反発し合ったり水に浮上したりします。その処理はとても負荷が大きく、容易にサーバーを重くします。例えば16×16の範囲で約16匹程の余裕を与え、水にも浮かないように気をつけましょう。\n\n## 村人を増やし過ぎない\n\n![](/img/2020-09-02_00.10.43.png)\n\nバージョン1.14で村人の仕様は大きく変わりました。他のMOBよりも多くのAI処理が働くのでサーバーへ大きな負荷を掛けます。都市部で管理する事は避け、周辺に他の村がないかよく確認し、必要以上に増やさないよう気をつけましょう。\n\n村人は本当に重いので一つの街で5（～10）人程度に抑えるくらい少数で管理しないとサーバーがとても重くなります。\n（サーバー側で村人の挙動を軽くする？ようなシステムを入れているようですが、増やしすぎないようにご協力ください）\n\n## ブロックエンティティ\n\nブロックエンティティの種類は[こちら](https://minecraft-ja.gamepedia.com/%E3%83%96%E3%83%AD%E3%83%83%E3%82%AF%E3%82%A8%E3%83%B3%E3%83%86%E3%82%A3%E3%83%86%E3%82%A3)を参照して下さい。\n\n通常のブロックよりもデータ量が多いので、ブロックエンティティが多く存在するチャンクを読み込む時は、サーバーに大きな負荷が掛かります。都市部で大量のチェスト類を管理する事は避け、倉庫は人気のない場所に作りましょう。\n\n### ホッパーを詰まらせない\n\n![](/img/2020-09-02_00.12.51.png)\n\nトラップ等によるアイテム処理や自動焼き機などはなるべく詰まらせないように気を付けましょう\n\nMinecraftの仕様上、ホッパーは中にアイテムが存在し続ける限り稼働し続けます。ホッパーは連結数を少なくし、詰まらせないように気を付けましょう。\n\n## 最後に﻿\n\nとくに全プレイヤーが訪れるといってもいい「資源サーバー初期スポーン」は考えなしにいろいろなブロックや案内看板、空チェストを置きまくると重くなりやすいです。\n皆さんで協力して快適な環境を作りましょう！\n\n装置自信ニキなのであれば、自由に装置を作れないと嘆くより、楽しみ方を他に見つけましょう。\n例えば、もりパという環境・制限の中で、いかにスタイリッシュに装置を組めるかということを楽しんでいるプレイヤーもいます。\n\nサーバーで遊ぶ全てのプレイヤーの為にもご協力をお願いします！\n\n- - -\n\n初期作成執筆者：Namiu﻿\n更新・加筆：MonnTotto\n最終更新日：2025/5/15"
}