{
  "date": "2025-04-08T12:03:52.675Z",
  "title": "Blue Cityの紹介",
  "slug": "bluecity",
  "description": "神森にできた新しい街の紹介。実はちょっと前からできてる",
  "image": "/img/blue-cityできたてほやほや.png",
  "category": "観光、案内",
  "body": "2024年最後のほうにできた街。実はちょっと前からできていて、カジノができるちょっと珍しい街。まだ人は少ないので是非来てくれるとありがたい!(^^)!\n\nに住むにはblue_of_skyに言って/pay blue_of_sky 500で500どんぐり払ったら住めるよ！　場所は神森spawnして左側！X:520 Z:11130\n\nDiscordのフォーラムリンクはこちら\nhttps://discord.com/channels/576354001696718859/1302173512357646366\n\n2﻿025/4/9\n\n目押しスロットのお金が出る量を増加\n\n2﻿025/4/11\n\n新しいパチンコ式のカジノを追加"
}