{
  "title": "第0回 夏祭り ( 2019.08.09 ~ 2019.08.11 )",
  "slug": "event01",
  "description": "それは、、、夢のような時間でした、、、",
  "date": "2019-11-05T15:27:51.174Z",
  "image": "",
  "category": "アーカイブ",
  "body": "![](/img/natu.png \"また来年会おう！\")\n\n## 注意\n\n第0回夏祭りは中止になりました。イベントの一部は秋イベントに持ち越されます。\n\n## 概要\n\n夏だ！まつりだ！浴衣美女だ！\n\nもりのパーティ 『夏祭り』開催決定！！\n\n今年の夏は雲丹が浜で思い出を作ろう！\n\n夏真っ盛り！台風に悩まされている地域の方は大丈夫ですか？ 森のパーティはThe server room is on 🔥‼ です。\n\nそんな当サーバーも皆様のおかげで運営開始から３ヵ月を迎えようとしています。いつも遊んでくださりありがとうございます！\n\n皆様に日頃の感謝を込めて初の大規模イベント「夏祭り」を開催します！！\n\n当日には花火大会やお化け屋敷、屋台などをご用意！\n\n他にもユーザーが楽しめる催し物を準備しているので当日はぜひもりのパーティへ遊びに来て下さい！運営スタッフ一同お待ちしています！\n\nなお、屋台スペースの解放日時については申し訳ありませんが、現状検討中ですので、決まり次第告知します！\n\nあまり広いスペースは取れないので、出店したい！という方は、アイデアを暖めておいてくださいね♪\n\n7月26日 執筆\n\n## 開催期間\n\n2019年8月9日(金) 19時00分 ~ 2019年8月11日(土)\n\n## 開催場所\n\n地域: 雲丹ヶ丘、雲丹ヶ浜\n\n座標: x; -500 z; -500 付近\n\n## 施設紹介\n\n#### お化け屋敷\n\n　自分の肝を試してみよう！\n\n　モデレーターですらビビらせたギミックに君は耐えることができ、無事脱出できるか？\n\n#### 謎のギャンブル施設\n\n　自分の運を試してみよう！\n\n　実際にお金を増やすこともできるかも……？\n\n#### 熱帯魚すくい\n\n　自分の腕を試してみよう！\n\n　すくった熱帯魚はお持ち帰りいただけます。\n\n#### 屋台スペース\n\n　夏祭り会場に自分の店を出店しよう！\n\n　運営側がある程度建設していますが、一般の方により参加して頂きたいので、応募状況により、スペースを開放致します\n\n## 時間イベント\n\n#### 花火大会\n\n　20時55分~21時00分までの5分間の間に開催予定！\n\n　綺麗でド派手な花火を皆で見に行こう！\n\n#### もりのパーティーミス☆コンテスト ( 8月10日(土)、8月11日(日)のみ開催 )\n\n　19時00分から開始予定！\n\n　もりのパーティー一番の美女を投票で決めよう！\n\n- - -\n\n執筆者：ErabaretaAyataka\n\n最終更新日：2019/10/26"
}