{
  "title": "もりパ！　Q&A集",
  "slug": "faq",
  "description": "森のパーティをプレイしていて疑問に思うこと･･･ここで解決の手助けになれば良いなっ♪　",
  "date": "2019-11-05T12:03:51.478Z",
  "category": "チュートリアル",
  "body": "# \\\n初期にもらえるアイテムについて\n\n## Q？　最初にもらう土地保護用の金シャベルは、使って壊したり、ロストしてしまったらどうなるの？\n\n**A!!**　一番最初にサーバーに入ったときに渡されるシャベルは、わかりやすく名前がついているだけです。\\\n金シャベルを新たにクラフトすれば、土地保護として使えます。金インゴッドを手に入れて、新しい金のシャベルをつくりましょう。\n\n**≪ワンポイント≫**金シャベルを安値で売ってる店が，どこかにあるぞっ！\n\n## **Q？**　金シャベルがなくて保護ができないっ！チェストの中身を取られたくないのにどうしたら良いの?\n\n**A!!**　そんなときは、コマンド「/cprivate 」や「/lock」でチェストを保護しましょう。\\\n土地が保護されてなくても、チェストを他人が開けられなくなります。\\\nあとは、なるべく早く金シャベルを入手（もしくはクラフト）して、土地の保護をしましょう。\\\n\\\n**≪ワンポイント≫**ロックしていても，土地の保護は誰かにされてしまい、チェストがいじれなくなります。\\\n　　　　　　　保護は早いうちに、必ずしましょう。\n\n## **Q？**　土地確認用の棒は特別な棒なの？\n\n**A!!**　棒も、金シャベルと一緒でわかりやすく名前をつけてあるだけです。\\\n無くしてしまった場合でも、木材からクラフトする普通の棒で代用できます。\\\n\\\n**≪ワンポイント≫**自分で棒を作って名前をつけなおせば、他の普通の棒と混ざらないので使いやすいかも！\n\n# スポーンについて\n\n## **Q？**　死んだ場合のスポーンの優先順位は？\n\n**A!!**　メインサーバーにて\n\n1. ベッド\n2. /sethome home\n3. /sethome その他\n\n一番最後に寝たベッドを壊した際には、設定されているsethomeの場所にスポーンします\n\n **≪ワンポイント≫**死んだら100円とられるぞっ！\n\n## Q?　 セットホームの数はいくつまで？\n\n**A!!**　   ベッドを除き3つまでです。（ベッドで寝るとそのベッドが4つめのホームとして設定されます）\\\n　　　コマンド「/homes」を開くと自分が設定したホーム達が見れます。\\\n　　　＜ただし！このコマンドを使った瞬間に使用料として100円がとられますので注意＞\\\n　　　飛びたい所のブロックを選択すると、画面中央下付近で\\\n　　　カウントダウンが３，２，１と始まります。\n\n# 質屋のチェストでの換金方法\n\n## Q?　どうやって原木を質屋に売るの？\n\n**A!!**　 ショップチェストで１．１５で新しいプラグインになってからは、質問が少なく\\\n　　 なりました(^o^)\\\n　　 ①チェストについている看板を左クリック。\\\n 　　②ショップ情報がでてきます。あとはチャット欄にでてくる通り\\\n 　　　販売したい数を入力。「○（こ）もっています」\n\n## \\\nQ?コマンドが分からなくなるんだけども。\n\n **A!!**『/clist』（コマンドリスト）というコマンドがあります。\\\n　　開くと目次が開いて、クリックするとその項目に関連するページに飛びます。\\\n 　　書いてあるコマンドにカーソルを乗せると、コマンドの意味と使用効果が表示されます。\\\n（２０２０/２月時点で一部コマンドは古いものです：shopchest等。　更新をお待ちください<m(__)m>）\n\n## \\\nQ？コマンドで『/r』が使えないです\n\n**A!!**　＜コマンド＞ 『/r』（/tへの返信）がだいぶ前から機能しておりません。 \\\n\\\nだいぶ前のディスコードメンテあたりに書き込みがあるため直近のひとは見つけにくいかも･･･ すみません。 \\\n**『/chat』**という機能をお使いいただければと思います。\n\n①『/chat＜ スペース＞相手のID』で 、自分のチャットが、ID相手にしか見えないようになります。 \\\n【peresistent chat have been started with ID. You can now write messages in public chat. 】と \\\n　黄色で出れば成功です。\\\n チャット欄表示は文字を打ったときに、【me→相手ID（暗い灰色）】（文字は変わらず白） に変化。\\\n② 解除時『/chat off』（※相手のIDは不必要） チャットに\\[Toggled of Persistent chat ]と出れば解除完了です。 \\\n\\\n＜使用ワンポイント＞\\\n　『/chat ID』 以降はチャット欄が相手との会話だけにシフトされるため、\\\n　他の人のチャットに反応したいときは こうしてみよう。\\\n○私の場合やってることを参考として書きますと\\\n ・一旦/chat off をする \\\n　または\\\n・ディスコードの生活（資源にいる人には資源）のチャットチャンネルに書き込み\n\n# 禁止されている建造物\n\n## Q?　無限増殖装置を作ってウハウハしていいの？\n\n**A!!**　バグを使用した無限増殖装置をはじめとし仕様を無視した建造、装置はルール上にある「ずるをしない」　     に抵触する行為で、最悪のケースとして**アクセスの禁止**も考えられるで絶対におやめください。\n\n- - -\n\n執筆者：MonnTotto\n\n更新者：tututututu201\n\n最終更新日：2020/02/16"
}