{
  "date": "2020-12-25T18:54:53.568Z",
  "title": "町湯・町湯トロッコ鉄道について",
  "slug": "machiyu",
  "description": "町湯のことをなんでも紹介しています☆",
  "image": "/img/2021-01-16_21.05.59.png",
  "category": "観光、案内",
  "body": "> **町湯**\n>\n> ![](/img/2021-03-12_22.57.12.png)\n\n町湯はtetutakaが中心となり建造中の山岳、丘陵地帯に位置する街です。\n\nレンガ造りのレトロな塔や家、風車、利便性の高い鉄道設備などが揃っています。\n\n空家も多くあり、無償で譲渡しています。\n\n現在ショップはほとんどなく、建造済みのビルなどに無償で出店を許可しています。\n\nお問い合わせはtetutakaまでお願いします。\n\n> **町湯トロッコ鉄道**\n>\n> ![](/img/2021-03-21_21.30.23.png)\n>\n> ![]()\n\n町湯トロッコ鉄道は、tetutakaが敷設している鉄道です。\n\n* 紅白線　大鷲浜―新白花街―町湯―紅島\n* 東南線　町湯―龜ヶ島―アルザーヌー白雪ーハルフォールーメサ\n* 東海岸線　アルザーヌ―八葉尻―来流別―古落内―吹䂓別\n* 町湯港線　町湯―町湯港\n\n> **町湯の軍事について**\n\n![](/img/2021-03-17_21.36.11.png)\n\n町湯では空中戦艦を独自開発し、他都市からのいかなる攻撃からも防御可能です。\n\n\n\n> **町湯の代表的な建築について**\n\n![町湯図書館](/img/2021-03-20_03.45.46.png)\n\n![町湯ザフィーアタワー](/img/2021-03-12_19.25.14.png)\n\n![右に見えるのが町湯フロントビルで、左に見えるのが町湯十一階](/img/2021-01-16_20.49.43.png)\n\n![町湯学院](/img/2021-02-12_20.54.13.png)\n\n**町湯図書館**\n\nこの世界の一般的な本はすべてこの図書館にあります。\n\n文芸、芸術、科学などなど、何でもそろっております。\n\n**町湯ザフィーアタワー**\n\n2021年4月現在、町湯のなかで最も高い建物です。\n\n**町湯フロントビル**\n\n町湯駅前にあるビルです。\n\n**町湯十一階**\n\n町湯の中で最も歴史のあるレンガ造りの塔です。\n\n**町湯学院**\n\n初等教育、中等教育、高等教育が行われています。\n\n編集 tetutaka"
}