{
  "date": "2025-05-16T15:38:49.651Z",
  "title": "モブぐるみ",
  "slug": "mobugurumi",
  "image": "/img/imageee.png",
  "description": "かわいいモブと、もっと身近に生活を！",
  "category": "投稿",
  "body": "**もりのパーティで、お気に入りのmobと一緒に暮らせる新しいコンテンツが登場！**\n\nもりのパーティ生活サーバーで、あたらしく「モブぐるみ」と生活できるようになりました！\n生活サーバーのうみもと（－６４０　ー１１００）にて、材料の毛糸の入手と、モブぐるみへの交換が可能です。\nモブぐるみを選んでも、また毛糸に戻すことができるので、お好きなモブを気軽に選んでいただけます。\n\n大変貴重なアイテムです。資源サーバー等でロストしても補填はいたしかねますので、大事になさってください。\n\nラインナップは順次追加予定。どうしても追加してほしいモブがあれば、モデルを制作してる人にこっそり言ってみるといいかも．．．．？\n\n現在のラインナップはこちら↓\n\n![](/img/mobu1-2-.png)\n\n> ◆ スニッファー Ｌサイズ。アニメーション付き、耳パタ鼻ヒクヒクです。ぐた～っと寝そべってます。頭装備は背中からの抱きつき。記念すべきモブぐるみ第１号。\n>\n> ◆ ブタ Ｍサイズ。お座りしてます。やや立体的なくるくる尻尾がチャーミング。\n>\n> ◆ アレイ Ｓサイズ。アニメーション付き、羽パタパタです。真鍮の角笛を持っています。\n>\n> ◆ ウォーデン Ｌサイズ。アニメーション付き、ヨダレだら～の心臓トクンッです。お座りして壁にもたれかかって居眠りしてます。眠るモブなのかは不明。頭装備は背中でおんぶ。\n>\n> ◆ ゾンビピッグマン Ｍサイズ。他の可愛いモブに対抗すべく３体並べて、トレードマークの金装備を持たせました。頭装備で背後をついてくる。２０１９年にゾンビピグリンとの戦いに敗れ姿を消した。\n\n![](/img/mobu2.png)\n\n> ◆ エンダーマン Ｌサイズ。いつもの直立エンダーマン。片手にコーラスフルーツが詰まったバスケットを持っている。\n>\n> ◆ ストライダー Ｌサイズ。キャラが弱いと感じたので３段重ねにして、頭にクリームを塗って、イチゴとロウソクを乗せました。ご賞味あれ！頭装備で背高帽に。首下にコンセントプラグがっ！\n>\n> ◆ シロクマ Ｍサイズ。スイカを片手に麦わら帽子を被った、おじさんグマ。頭装備で肩車します。\n>\n> ◆ ホグリン Ｓサイズ。アニメーション付き、ヨダレだらーです。ウォーデンの涎の使いまわし。ブタ同様にお座りして尻尾が飛び出てます。頭装備で…なんだろコレ。お面？\n>\n> ◆ 月のウシ Ｍサイズ。ポージングを思い付けなかったけど、作りたかった。２０２３年のエイプリルフールバージョンに登場した公式モブ。\n\n![](/img/mobu3.png)\n\n> ◆ クリーパー（工事） Ｍサイズ。黄色の安全ヘルメットを被ってます。謎に貫禄を感じる。安全確認ヨシッ！\n>\n> ◆ クリーパー（救急） Ｍサイズ。ＡＥＤと書かれた赤い箱を携えています。え、工事クリーパーの使い回し？\n>\n> ◆ ペンギン Ｍサイズ。２０２３年モブ投票にて３位、アルマジロに惜敗した幻のモブ。ボートの速度を上げる効果を持つ予定だった。\n>\n> ◆ タフゴーレム Ｍサイズ。湯気のアニメーション付き、お茶汲みゴーレム。２０２２年モブ投票で２位の幻のモブ。物を持った状態で一時停止する習性がありインテリア的な用途が期待された。\n>\n> ◆ ラスカル Ｍサイズ。２０２２年モブ投票にて２位、スニッファーに惜敗した幻のモブ。廃坑で暮らすイタズラ好き。かくれんぼで見つけ出すとアイテムをくれる。\n>\n> ![](/img/mob4.png)\n>\n> > ◆ グレア Ｍサイズ。眼のアニメーション付き。頭装備でモサモサに。２０２１年モブ投票にて３位、アレイに惜敗した幻のモブ。暗闇が苦手な宙に浮くモブ。\n> >\n> > ◆ ラヴェジャー ＬＬサイズ。上手くポージング出来なかったので位置調整に注力しました。額縁sit、透明化rideで楽しもう。\n> >\n> > ◆ エンダードラゴン(幼体) Ｌサイズ。孵化シーンを再現しました。ドラゴンの卵は原寸サイズ。データサイズは最大級。\n> >\n> > ◆ エンダードラゴン(成体) ＸＬサイズ。もったいないので、ドラゴンの卵むいちゃいました。３倍増しマシサイズ。とにかくデカイ！\n> >\n> > ◆ コウモリ Ｓサイズ。額縁を天井裏に配置すると、４匹のコウモリが天井にぶら下がってくれます。２０２３年にテクスチャとモーションが変更された。\n> >\n> > ![](/img/mob5.png)\n> >\n> > > ◆ イカ Ｌサイズ。足を１本上に上げているフレンドリーなイカ。頭装備でイカ人間になれます。いきなり現れるとびっくりするかも。\n> > >\n> > > ◆ カメ Ｍサイズ。前ヒレのアニメーション付き。地上での動きが鈍いところが保護欲をくすぐります。\n> > >\n> > > ◆ キツネ・雪キツネ Ｍサイズ。頭、尻尾のアニメーション付き。まどろんでます。抱っこも可能。\n> > >\n> > > ◆ パンダ Ｍサイズ。某クマのぬいぐるみの様に両腕を広げ座っています。一番モブぐるみっぽいのでは？一応パンダ座りしてます。\n> >\n> > credit\n> > 企画:macaronipenguin\n> > *モデル制作: macaronipenguin*,kina1120\n> > テクスチャパック調整:tyonaa\n> >\n> >"
}