{
  "date": "2020-05-10T02:02:17.971Z",
  "title": "redyamori氏主催　常設フリーマーケット開店！",
  "description": "もりもと東でフリーマーケット実施中！　お得な商品がいっぱいあるよ！　",
  "category": "投稿",
  "body": "# もりもと東に常設フリーマーケットがオープン！\n\n建材、花火、食料など生活に必要なものが全てそろっている！................わけでもないが\n\n皆さんが持ち寄ったお得な商品がたくさんありますよ ! ぜひお立ち寄りください！\n\n## 参加方法\n\n\\    1. **redyamori**氏に一声かける。　例「ここに出店してもいいですか？」\n\n\\    2.  空いているスペースにショップを設置する　(ショップの設置方法はwiki参照)\n\n### 　　これだけでOK！\n\n出店は**早い者勝ち**です！店を出そうかなと考えている方は**お早めに！**",
  "slug": "redfree",
  "image": "/img/チラシ第一作.png"
}