{
  "date": "2023-08-09T01:14:16.655Z",
  "body": "## アクアモンド鉄道\n\nアクアモンド鉄道はエンドポータルを中心に広がる鉄道です。現在１路線と３駅があります。エンドポータル駅を中心とした延線、新路線計画もあります。アクアモンド鉄道では看板による高い視認性を目指しています！また、それぞれの駅にエスペラントでの併記がされているのが特徴です。\n\n## 路線と鉄道駅\n\n**オリエント線(La Orienta Linio)**\n\n* エンドポータル駅(La Endportalo)\n* 天空城駅(Ĉielkastelo)\n* 天空図書館前駅(Ĉielbiblioteko)\n\n## 計画\n\n﻿**オリエント線**\n\n* 天空図書館前駅から西に延ばし、うみもと駅を作る\n* 複線化\n\n**新路線**\n\n* あつもり方面（スード線）\n* メチェリーの里方面（ノルド線）\n\n  どちらもエンドポータル駅から延ばす計画です。",
  "title": "鉄道案内:アクアモンド鉄道",
  "slug": "train_akvamondo",
  "description": "エンドポータルを中心に広がる鉄道です。",
  "image": "/img/image.png",
  "category": "観光、案内"
}