{
  "date": "2022-01-27T08:59:23.154Z",
  "title": "投票ボーナス",
  "slug": "voteinfo",
  "description": "投票ボーナス機能がパワーアップして帰ってきました！ ",
  "category": "MOD・プラグイン",
  "body": "## 投票ボーナス機能がパワーアップしました!!\n\nくらふたーの総合投票数は、10回以上投票している人のみ引き継ぎしています！\nオフライン投票対応でログインした時に報酬を受け取れます！\n報酬は生活サーバーでのみ受け取れます！\n\n## 報酬一覧\n\n・通常報酬で投票ガチャチケット🎫\n・初めての投票で500﻿☘️\n・1日に1回だけ300﻿☘️　\n・10回ごとに300﻿☘️と保護100🏕️﻿\n・100回ごとに自分の頭💀\n・30日連続投票でガチャチケット×5🎫\n・月間投票数ランキング1位でトロフィー\n\n\\[未実装]\n・サーバー全体での投票数に応じた報酬\n・投票ポイントで使えるショップ\n\n## コマンド一覧\n\n/vote - 投票サイト一覧を表示\n/vote Best - 投票数のベストスコアを表示\n/vote Choices - 選択可能な報酬(未実装\n/vote GUI - 投票メニュー画面を開く\n/vote Help/? - ヘルプを開く\n/vote Help/? <数字> - 指定したページのヘルプを開く\n/vote Last -投票してからの経過時刻を見れます \n/vote Listまたは/vote All - 投票リンク先(monocraftとJMS)が表示されます\n/vote Next - あと何時間でまた投票できるか表示されます\n/vote Party - 現在の投票額と必要な数が表示されます。\n/vote Points - ポイントを表示します\n/vote Shop (文字) -開いている投票ショップを表示します\n/vote Streak - 自分の投票、デイリーなどの連続回数が表示されます\n/vote Today - 今日投票した人のリストを表示します\\\n/vote Today (number) - 今日投票した人達のページを表示します\n/vote ToggleBroadcast - 投票のお知らせを切り替えることができます\n/vote Top All - 総合と月間の投票ランキングを表示します\n/vote Top Daily -デイリーの投票の日間と総合ランキングを表示します\n/vote Top Monthly - 毎月の投票トップを表示します\n/vote Top Weekly - 週間の投票トップを表示します\n/vote Total - 自分の投票総数を表示します\n/vote Total All - サーバーの総投票数の表示します\n/vote URL - 投票リンクへの候補が表示されます\n\n　なお！！\n・サーバー全体での投票数に応じた報酬\n・投票ポイントで使えるショップ\nは未実装です！"
}